backend/app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    render json: Game.all

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Game.find(params[:id])